
[
  { "country": "Nigeria", "bride_price_usd": 2000, "region": "Africa", "description": "In Nigeria, the bride price, also known as a dowry, is a payment made by the groom's family to the bride's family. The amount can vary greatly depending on the region, ethnicity, and the families' economic status." },
  { "country": "Kenya", "bride_price_usd": 1500, "region": "Africa", "description": "In Kenya, the bride price is a traditional practice. It's often paid in the form of livestock, but cash is also common. The amount is negotiated between the families." },
  { "country": "Ghana", "bride_price_usd": 1000, "region": "Africa", "description": "In Ghana, the bride price is a gesture of appreciation to the bride's family for their daughter's upbringing. It's a symbolic act and the amount is not always high." },
  { "country": "South Africa", "bride_price_usd": 2500, "region": "Africa", "description": "In South Africa, the practice of 'lobola' (bride price) is common. It's a way of showing respect and commitment. The negotiation process can be lengthy and involves extended family members." },
  { "country": "India", "bride_price_usd": 3000, "region": "Asia", "description": "In India, the dowry system is a significant cultural practice, although it's officially prohibited by law. The bride's family often gives a substantial amount of money, gold, and other gifts to the groom's family." },
  { "country": "China", "bride_price_usd": 10000, "region": "Asia", "description": "In China, the 'caili' (bride price) has been a long-standing tradition. In recent years, the amount has skyrocketed in some regions, causing social concern." },
  { "country": "Thailand", "bride_price_usd": 5000, "region": "Asia", "description": "In Thailand, the 'sin sod' is a bride price paid by the groom to the bride's family. It's a way to show financial stability and to honor the bride's parents." },
  { "country": "Vietnam", "bride_price_usd": 4000, "region": "Asia", "description": "In Vietnam, the bride price is a tradition that symbolizes the groom's ability to provide for his wife. The amount and form of payment vary across the country." },
  { "country": "United States", "bride_price_usd": 0, "region": "North America", "description": "The practice of paying a bride price is not a tradition in the United States. However, engagement rings are a common gift from the groom to the bride." },
  { "country": "United Kingdom", "bride_price_usd": 0, "region": "Europe", "description": "The bride price is not a tradition in the UK. Instead, wedding costs are often shared between the couple or their families." },
  { "country": "Australia", "bride_price_usd": 0, "region": "Oceania", "description": "There is no tradition of a bride price in Australia. Wedding expenses are typically covered by the couple." },
  { "country": "Brazil", "bride_price_usd": 0, "region": "South America", "description": "Brazil does not have a bride price tradition. Wedding costs are usually shared by the couple or their families." },
  { "country": "Russia", "bride_price_usd": 1000, "region": "Europe", "description": "While not as common as it once was, some regions in Russia still practice a form of bride price, often as a symbolic gesture." },
  { "country": "Egypt", "bride_price_usd": 3000, "region": "Africa", "description": "In Egypt, the 'mahr' is a mandatory payment from the groom to the bride, which is part of the Islamic marriage contract." },
  { "country": "Afghanistan", "bride_price_usd": 5000, "region": "Asia", "description": "In Afghanistan, the bride price is a significant part of marriage negotiations and can be a substantial amount, often making it difficult for young men to marry." },
  { "country": "Pakistan", "bride_price_usd": 2000, "region": "Asia", "description": "In Pakistan, the 'haq mehr' is a mandatory payment, which is usually in the form of money or possessions paid by the groom to the bride at the time of marriage." },
  { "country": "Indonesia", "bride_price_usd": 1200, "region": "Asia", "description": "In Indonesia, the 'mahar' is a gift from the groom to the bride, as a symbol of his love and responsibility. The form and amount vary widely." },
  { "country": "Japan", "bride_price_usd": 0, "region": "Asia", "description": "Japan does not have a bride price tradition. However, a 'yuino' ceremony may take place where the groom's family presents gifts to the bride's family." },
  { "country": "South Korea", "bride_price_usd": 0, "region": "Asia", "description": "In South Korea, there is no traditional bride price. Instead, families may exchange gifts, and the groom's family may help with housing." },
  { "country": "Germany", "bride_price_usd": 0, "region": "Europe", "description": "Germany does not have a bride price tradition. Wedding costs are typically shared by the couple." },
  { "country": "France", "bride_price_usd": 0, "region": "Europe", "description": "There is no tradition of bride price in France. Wedding costs are generally shared." },
  { "country": "Italy", "bride_price_usd": 0, "region": "Europe", "description": "Italy does not have a bride price tradition. It is common for the bride's family to contribute to the wedding costs." },
  { "country": "Spain", "bride_price_usd": 0, "region": "Europe", "description": "There is no bride price tradition in Spain. Couples typically share wedding expenses." },
  { "country": "Canada", "bride_price_usd": 0, "region": "North America", "description": "The practice of paying a bride price is not a tradition in Canada. Wedding costs are usually shared by the couple and their families." },
  { "country": "Mexico", "bride_price_usd": 500, "region": "North America", "description": "While not widespread, in some rural areas of Mexico, a symbolic payment or gift from the groom's family to the bride's family may occur." },
  { "country": "Argentina", "bride_price_usd": 0, "region": "South America", "description": "Argentina does not have a bride price tradition." },
  { "country": "Colombia", "bride_price_usd": 0, "region": "South America", "description": "There is no bride price tradition in Colombia." },
  { "country": "New Zealand", "bride_price_usd": 0, "region": "Oceania", "description": "There is no tradition of a bride price in New Zealand." },
  { "country": "Philippines", "bride_price_usd": 1000, "region": "Asia", "description": "In some parts of the Philippines, a 'bigay-kaya' is given by the groom's family to the bride's family, symbolizing his capacity to support his wife." },
  { "country": "Turkey", "bride_price_usd": 1500, "region": "Asia", "description": "In Turkey, the 'başlık parası' is a bride price, although the practice is becoming less common, especially in urban areas." },
  { "country": "Iran", "bride_price_usd": 2500, "region": "Asia", "description": "The 'mehrieh' in Iran is a mandatory payment from the groom to the bride, specified in the marriage contract." },
  { "country": "Saudi Arabia", "bride_price_usd": 13000, "region": "Asia", "description": "The 'mahr' in Saudi Arabia is a significant financial gift from the groom to the bride." },
  { "country": "United Arab Emirates", "bride_price_usd": 20000, "region": "Asia", "description": "In the UAE, the 'mahr' is a substantial payment made by the groom to the bride." },
  { "country": "Ethiopia", "bride_price_usd": 800, "region": "Africa", "description": "Bride price practices in Ethiopia vary by ethnic group, often involving livestock or cash." },
  { "country": "Uganda", "bride_price_usd": 1300, "region": "Africa", "description": "In Uganda, the bride price is a long-standing tradition, with the amount negotiated between families." },
  { "country": "Tanzania", "bride_price_usd": 900, "region": "Africa", "description": "In Tanzania, the bride price, or 'mahari', is a payment from the groom's family to the bride's." },
  { "country": "Morocco", "bride_price_usd": 2000, "region": "Africa", "description": "The 'sadaq' in Morocco is a gift from the groom to the bride, as part of the Islamic marriage tradition." },
  { "country": "Algeria", "bride_price_usd": 1800, "region": "Africa", "description": "In Algeria, the 'mahr' is a mandatory marriage gift from the groom to the bride." },
  { "country": "Libya", "bride_price_usd": 4000, "region": "Africa", "description": "The bride price in Libya is a significant financial commitment for the groom." },
  { "country": "Sudan", "bride_price_usd": 1000, "region": "Africa", "description": "In Sudan, the bride price can be paid in cash or livestock, and is a key part of marriage negotiations." },
  { "country": "Zimbabwe", "bride_price_usd": 1800, "region": "Africa", "description": "In Zimbabwe, the bride price, known as 'roora', is a traditional practice that involves the groom's family making payments to the bride's family. It's a gesture of appreciation and a way to formalize the union between the two families. The payment can be in the form of cash or livestock." }
]
